ConnectTest/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствоватьВРассылкеEmail</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствоватьВРассылкеСообщений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Холдинг</name>
    <type>
      <types>CatalogRef.Холдинги</types>
    </type>
  </attributes>
  <attributes>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ConnectTest/src/InformationRegisters/ПаролиПользователей/ПаролиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПаролиПользователей</name>
  <resources>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокДействия</name>
    <comment>указана дата, до которой пароль считается актуальным, если дата не указана значит это постоянный пароль</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ConnectTest/src/Catalogs/Пользователи/ManagerModule.bsl
Функция ПроверитьПароль(ЯзыкПриложения, Пользователь, Пароль) Экспорт
		
	пЗапрос	= Новый Запрос;
	пЗапрос.Текст	= "ВЫБРАТЬ ПЕРВЫЕ 1
	             	  |	ПаролиПользователей.Пользователь КАК Пользователь
	             	  |ИЗ
	             	  |	РегистрСведений.ПаролиПользователей КАК ПаролиПользователей
	             	  |ГДЕ
	             	  |	ПаролиПользователей.Пользователь = &Пользователь
	             	  |	И ПаролиПользователей.Пароль = &Пароль";
	
	пЗапрос.УстановитьПараметр("Пользователь", Пользователь);
	пЗапрос.УстановитьПараметр("Пароль", Пароль);
	
	РезультатЗапроса	= пЗапрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда		
		ОписаниеОшибки	= Служебный.ПолучитьОписаниеОшибки(ЯзыкПриложения, "passwordIsNotCorrect");
	Иначе
		ОписаниеОшибки	= Служебный.ПолучитьОписаниеОшибки(ЯзыкПриложения, "");
	КонецЕсли;
	
	Возврат ОписаниеОшибки;
	
КонецФункции

Функция ВременныйПароль(ДлинаПароля = 4) Экспорт 
	Пароль	= "";	
	ГСЧ		= Новый ГенераторСлучайныхЧисел();	
	Для Сч = 1 По ДлинаПароля Цикл		
		СлучайноеЧисло	= ГСЧ.СлучайноеЧисло(48,57);		
		Пароль	=	Пароль + Символ(СлучайноеЧисло);
	КонецЦикла;	
	Возврат Пароль;	
КонецФункции

Функция УстановитьПарольПользователя(Пользователь, Пароль = "") Экспорт 
	
	СрокДействия	= Дата(1,1,1);
	
	Если Пароль = "" Тогда
		Пароль	= ВременныйПароль();
		СрокДействия	= УниверсальноеВремя(ТекущаяДата()) + 900; //время действия пароля 15 минут
	КонецЕсли;
	
	Запись	= РегистрыСведений.ПаролиПользователей.СоздатьМенеджерЗаписи();
	Запись.Пользователь	= Пользователь;
	Запись.Пароль		= Пароль;
	Запись.СрокДействия	= СрокДействия;
	Запись.Записать();
	
	Возврат Пароль;
	
КонецФункции

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПоляПредставления = Новый Массив;
	ПоляПредставления.Добавить("Фамилия");
	ПоляПредставления.Добавить("Имя");	
	ПоляПредставления.Добавить("Холдинг");		
	
	Поля = ПоляПредставления;
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)	
	
	СтандартнаяОбработка = Ложь;
	Представление	= "" + Данные.Фамилия + " " + Данные.Имя + " (" + Данные.Холдинг + ")";		
	
КонецПроцедуры
